import CardImage from "@/src/assets/card_image.png"
import CardImage2 from "@/src/assets/card_image2.jpg"
import CardImage4 from "@/src/assets/card_image4.jpg"
import CardImage5 from "@/src/assets/card_image5.jpg"

export const TEXT_CONTENTS = ["끊임없는 호기심으로 성장을 이끄는 기술 블로그 입니다."]

export const CARD_VARIANTS = [
  {
    category: "학습",
    title: "항상 새로운걸 배웁니다.",
    content: "새로운걸 배우는데 별다른 노력이 필요하지 않습니다. 원래 새로운걸 좋아합니다.",
    image: CardImage,
    createdAt: Date.now(),
  },
  {
    category: "학습",
    title: "항상 도전합니다.",
    content: "무언가를 도전하는데 큰 두려움을 가지질 않습니다.",
    image: CardImage2,
    createdAt: Date.now(),
  },
  {
    category: "학습",
    title: "항상 기록합니다.",
    content:
      "뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.뛰어난 기억력보다 조잡한 기록이 결국 더 쓸모가 있다는걸 알기에 항상 기록합니다.",
    image: CardImage4,
    createdAt: Date.now(),
  },
  {
    category: "학습",
    title: "키는 작지만 꿈은 큽니다.",
    content: "언제나 멀리나갈 준비를 하기에 함께 믿고 나아가셔도 됩니다.",
    image: CardImage5,
    createdAt: Date.now(),
  },
]
